Revit 2024 API
BendingDetailSegmentLengthsDisplayOptions Enumeration
 Describes if the segment lengths are represented using dimensions or just as text.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Since: 2024
Syntax
C#
public enum BendingDetailSegmentLengthsDisplayOptions
Visual Basic
Public Enumeration BendingDetailSegmentLengthsDisplayOptions
Visual C++
public enum class BendingDetailSegmentLengthsDisplayOptions
Members
Member name | Description
Text |  Display as texts
Dimension |  Display as dimensions
See Also
Autodesk.Revit.DB.Structure Namespace